# 참조데이터가 필요 없는 경우

In [1]:
import pandas as pd

In [7]:
df1 = pd.read_csv('날짜포맷이다른데이터1.csv')
df2 = pd.read_csv('날짜포맷이다른데이터2.csv')

In [8]:
df1.head()

           날짜        V1
0  2018-01-01  0.330646
1  2018-01-02  0.418242
2  2018-01-03  0.307254
3  2018-01-04  0.441689
4  2018-01-05  0.402440

In [9]:
df2.head()

            날짜        V2
0  2018년 1월 1일  0.936350
1  2018년 1월 2일  0.658967
2  2018년 1월 3일  0.895686
3  2018년 1월 4일  0.047194
4  2018년 1월 5일  0.520925

In [10]:
def date_type_converter(value):
    YYYY,MM,DD = value.split("-")
    return YYYY + '년 ' + str(int(MM)) + '월 ' + str(int(DD)) + '일'

df1['날짜'] = df1['날짜'].apply(date_type_converter)

In [11]:
merged_df = pd.merge(df1, df2, on = '날짜')
merged_df

                날짜        V1        V2
0      2018년 1월 1일  0.330646  0.936350
1      2018년 1월 2일  0.418242  0.658967
2      2018년 1월 3일  0.307254  0.895686
3      2018년 1월 4일  0.441689  0.047194
4      2018년 1월 5일  0.402440  0.520925
..             ...       ...       ...
725  2019년 12월 27일  0.011439  0.191205
726  2019년 12월 28일  0.549821  0.153435
727  2019년 12월 29일  0.607895  0.856630
728  2019년 12월 30일  0.892261  0.775208
729  2019년 12월 31일  0.229388  0.119601

[730 rows x 3 columns]

# 참조 데이터가 필요한 경우

In [15]:
ref_df = pd.read_csv('시승격정보.csv', encoding = 'cp949')
df1 = pd.read_excel('인구수데이터.xlsx', sheet_name = '202006')
df2 = pd.read_excel('인구수데이터.xlsx', sheet_name = '201108')

In [16]:
# 사전으로 변환
ref_dict = ref_df.set_index('승격전')['승격후'].to_dict()

In [17]:
# 군 정보를 시 정보로 변환(사전의 값으로 변환됨)
df2['행정구역'] = df2['행정구역'].replace(ref_dict)

In [18]:
# 변수 명이 전부 같아서 수정해야함
df1.set_index('행정구역', inplace = True)
df2.set_index('행정구역', inplace = True)
# 인덱스를 제외한 모든 칼럼명 앞에 붙여줌
df1 = df1.add_prefix('202006_')
df2 = df2.add_prefix('201108_')

In [19]:
merged_df = pd.merge(df1, df2, left_index = True, right_index = True)
merged_df.head()

,202006_총인구수,202006_남자인구수,202006_여자인구수,201108_총인구수,201108_남자인구수,201108_여자인구수
행정구역,,,,,,
여주시,111341,56582,54759,109019,55122,53897
당진시,166084,88015,78069,148175,76555,71620
아산시,313054,162398,150656,271356,138150,133206